---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementIntersectsFilter
source: html/f8ee6344-1b97-2314-86c7-bd116ab7e678.htm
---
# ElementIntersectsFilter Members

Identifies if the input element is of a category supported by element intersection filters.